# Zsh Packages
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "starship"
brew "fzf"

# Development Packages
brew "git"
brew "gh"
brew "gnupg"
brew "neovim"
brew "nodenv"
brew "pyenv"

brew "golang"

# Kubernetes Packages
brew "kubernetes-cli"
brew "kubectx"
brew "helm"
brew "k9s"
brew "docker"
brew "docker-completion"
brew "colima"

# Utility Packages
brew "bat"
brew "fd"
brew "jq"
brew "tree"
brew "stow"
brew "ripgrep"
brew "eza"

# Install terraform
brew "terraform"
brew "terraform-docs"
brew "tflint"
brew "tfsec"
