# Zsh Packages
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "starship"
brew "fzf"

# Development Packages
brew "git"
brew "nvim"
brew "nodenv"
brew "pyenv"

# Kubernetes Packages
brew "kubectx"
brew "kubectl"
brew "helm"
brew "k9s"

# Utility Packages
brew "bat"
brew "fd"
brew "jq"
brew "tree"
brew "stow"
brew "ripgrep"
brew "exa"

